app/controllers/elements_controller.rb

    def set_element
      @element = Element.find(params[:id])
---
SELECT "elements".* FROM "elements" WHERE "elements"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]