app/controllers/forces_controller.rb

  def index
    @forces = Force.all
---
SELECT "forces".* FROM "forces"

  def create
    @force = Force.new(force_params)

    respond_to do |format|
      if @force.save
---
INSERT INTO "forces" ("title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Superteam"], ["user_id", 1], ["created_at", "2020-10-31 18:24:58.162236"], ["updated_at", "2020-10-31 18:24:58.162236"]]

  def update
    respond_to do |format|
      if @force.update(force_params)
---
UPDATE "forces" SET "title" = ?, "main_force_figures" = ?, "main_force_objects" = ?, "main_force_maps" = ?, "main_force_map_bonus" = ?, "sideline_elements" = ?, "hold_elements" = ?, "build_pts" = ?, "total_pts" = ?, "updated_at" = ? WHERE "forces"."id" = ?

    def set_force
      @force = Force.find(params[:id])
---
SELECT "forces".* FROM "forces" WHERE "forces"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]